/* Relative time for 1.5 to 24 hours */
"Hours" = "Hours";

/* Relative time for 2 to 59 minutes */
"Minutes" = "Minutes";

/* Relative time for 59.5 minutes to 1.5 hours */
"1 Hour" = "1 Hour";

/* Relative time for 30 to 90 seconds */
"1 Minute" = "1 Minute";

/* Relative time for less than 30 seconds */
"Just Now" = "Just Now";

